0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}

dimensions      [1 -1 -2 0 0 0 0];   // SI unit: Pascal (Pa)

internalField   uniform 0;    // Initial pressure: uniform (0 Pa)

boundaryField
{
    fan_inlet
    {
        type zeroGradient;    // No pressure variation at the fan inlet
    }

    aircon_inlet
    {
        type zeroGradient;    // No pressure variation at the aircon inlet
    }

    walls
    {
        type fixedFluxPressure;   // Standard wall condition for pressure
    }
}


// ************************************************************************* //
